export const HostProjectGuide = Object.freeze({
  general: [
    `프레이밋의 모든 프로젝트는 ‘상호무페이’입니다.\n게스트에게 돈을 요구하는 등 정책에 위반하는 행위를 하는 경우,\n프레이밋 활동에 제한을 받을 수 있습니다.`,
    `‘모집 중’인 프로젝트만 프로젝트 공고를 수정할 수 있습니다.`,
    `‘프로젝트 시작’을 눌러 프로젝트를 시작하면, 변경할 수 없습니다.\n지원자를 신중하게 결정하세요.`,
    `프로젝트는 [모집 중 - 진행 중 - 완료] 로 진행됩니다.`,
    `프로젝트를 완료한 즉시, 상대방에게 리뷰를 남길 수 있습니다.`,
  ],
  cancellation: [
    `프로젝트를 취소하고 싶은 경우, 취소하고 싶은 프로젝트의 제목, 호스트 닉네임, 게스트 닉네임과 취소사유를 적어 프레이밋 이메일(2024.frameit@gmail.com)로 접수해주세요.`,
    `취소 접수 동안은 ‘진행 중’ 상태를 유지합니다.`,
    `취소된 프로젝트는 ‘취소’ 상태로 변경됩니다.`,
  ],
});

export const GuestProjectGuide = Object.freeze({
  general: [
    `프레이밋의 모든 프로젝트는 ‘상호무페이’입니다.\n호스트가 돈을 요구하는 등 정책에 위반하는 행위를 하는 경우, 프레이밋 이메일(2024.frameit@gmail.com)로 신고해 주세요.`,
    `프로젝트는 [모집 중 - 진행 중 - 완료] 로 진행됩니다.`,
    `프로젝트를 완료 즉시, 상대방에게 리뷰를 남길 수 있습니다.`,
  ],
  cancellation: [
    `모집 중인 프로젝트는 신청을 취소할 수 있습니다.`,
    `진행 중인 프로젝트를 취소하고 싶은 경우, 취소하고 싶은 프로젝트의 제목, 호스트 닉네임, 게스트 닉네임과 취소사유를 적어 프레이밋 이메일(2024.frameit@gmail.com)로 접수해주세요.`,
    `취소 접수 동안은 ‘진행 중’ 상태를 유지합니다.`,
    `취소된 프로젝트는 ‘취소’ 상태로 변경됩니다.`,
  ],
  inProgress: [
    '호스트와 게스트 모두가 ‘프로젝트 완료’를 눌러야 프로젝트가 정상 완료됩니다.',
    '프로젝트를 완료하면 변경할 수 없습니다.',
  ],
});
